# Brewfile
#
# Install everything with:
#
#     brew bundle --file=~/Desktop/dotfiles/Brewfile
#
# To check what's missing or extra:
#
#     brew bundle check --file=~/Desktop/dotfiles/Brewfile
#     brew bundle cleanup --file=~/Desktop/dotfiles/Brewfile
#

# Taps
tap "charmbracelet/tap"
tap "derailed/k9s"

# Core tools
brew "bash"            # Modern bash (5.x) — macOS ships 3.2
brew "asdf"            # Version manager for runtimes (node, ruby, etc.)
brew "ctags"
brew "diff-so-fancy"   # Better git diffs
brew "fpp"             # Facebook PathPicker
brew "fzf"             # Fuzzy finder
brew "gh"              # GitHub CLI
brew "gnu-sed"         # GNU sed (replaces BSD sed)
brew "gnupg"           # GPG
brew "jq"              # JSON
brew "neovim"
brew "ripgrep"         # Fast grep (rg)
brew "rsync"
brew "ssh-copy-id"
brew "wget"

# Tmux
brew "tmux"
brew "tmuxinator"

# Cloud / infra
brew "flyctl"          # Fly.io CLI
brew "ollama"          # Local LLM runner
brew "worktrunk"

# TUIs
brew "derailed/k9s/k9s"
brew "pi-coding-agent"

# Bash completions (new for bash switch)
brew "bash-completion@2"

# Apps
cask "ghostty"
cask "firefox@developer-edition"
cask "hammerspoon"
cask "orbstack"
cask "claude-code"
cask "cursor"
cask "obsidian"
